Revit 2027 API
PerformanceAdviser.WillRuleCheckElements Method
Overload List
Name | Description
WillRuleCheckElements(Int32) |  Reports if rule needs to be executed on individual elements.
WillRuleCheckElements(PerformanceAdviserRuleId) |  Reports if rule needs to be executed on individual elements.
Top
See Also
Reference
PerformanceAdviser Class
Autodesk.Revit.DB Namespace